Revit 2024 API
BuiltInFailures.GenericMEPFailures.InlineEndoflineMismatch Property
 [Element Name]: It is not possible to calculate the flow since there is inline equipment that is configured as end of line. Please check equipment in this system and make sure that the equipment connectors used inline have a global system classification and a calculated flow configuration. Global equipment connectors used inline should always be linked to each other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InlineEndoflineMismatch { get; }
Visual Basic
Public Shared ReadOnly Property InlineEndoflineMismatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InlineEndoflineMismatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace